# -*- coding: utf-8 -*-
import json
import re

CITIES=['乌鲁木齐', '克拉玛依', '拉萨 ', '银川', '石嘴山', '吴忠', '固原', '中卫', '呼和浩特', '包头', '乌海', '赤峰', '通辽', '鄂尔多斯', '呼伦贝尔', '巴彦淖尔', '乌兰察布', '南宁', '柳州', '桂林', '梧州', '北海', '崇左', '来宾', '贺州', '玉林', '百色', '河池', '钦州', '防城港', '贵港', '哈尔滨', '大庆', '齐齐哈尔', '佳木斯', '鸡西', '鹤岗', '双鸭山', '牡丹江', '伊春', '七台河', '黑河', '绥化', '长春', '吉林', '四平', '辽源', '通化', '白山', '松原', '白城', '沈阳', '大连', '鞍山', '抚顺', '本溪', '丹东', '锦州', '营口', '阜新', '辽阳', '盘锦', '铁岭', '朝阳', '葫芦岛', '石家庄', '唐山', '邯郸', '秦皇岛', '保定', '张家口', '承德', '廊坊', '沧州', '衡水', '邢台', '济南', '青岛', '淄博', '枣庄', '东营', '烟台', '潍坊', '济宁', '泰安', '威海', '日照', '莱芜', '临沂', '德州', '聊城', '菏泽', '滨州', '南京', '镇江', '常州', '无锡', '苏州', '徐州', '连云港', '淮安', '盐城', '扬州', '泰州', '南通', '宿迁', '合肥', '蚌埠', '芜湖', '淮南', '亳州', '阜阳', '淮北', '宿州', '滁州', '安庆', '巢湖', '马鞍山', '宣城', '黄山', '池州', '铜陵', '杭州', '嘉兴', '湖州', '宁波', '金华', '温州', '丽水', '绍兴', '衢州', '舟山', '台州', '福州', '厦门', '泉州', '三明', '南平', '漳州', '莆田', '宁德', '龙岩', '广州', '深圳', '汕头', '惠州', '珠海', '揭阳', '佛山', '河源', '阳江', '茂名', '湛江', '梅州', '肇庆', '韶关', '潮州', '东莞', '中山', '清远', '江门', '汕尾', '云浮', '海口', '三亚', '昆明', '曲靖', '玉溪', '保山', '昭通', '丽江', '普洱', '临沧', '贵阳', '六盘水', '遵义', '安顺', '成都', '绵阳', '德阳', '广元', '自贡', '攀枝花', '乐山', '南充', '内江', '遂宁', '广安', '泸州', '达州', '眉山', '宜宾', '雅安', '资阳', '长沙', '株洲', '湘潭', '衡阳', '岳阳', '郴州', '永州', '邵阳', '怀化', '常德', '益阳', '张家界', '娄底 ', '武汉', '襄樊', '宜昌', '黄石', '鄂州', '随州', '荆州', '荆门', '十堰', '孝感', '黄冈', '咸宁', '郑州', '洛阳', '开封', '漯河', '安阳', '新乡', '周口', '三门峡', '焦作', '平顶山', '信阳', '南阳', '鹤壁', '濮阳', '许昌', '商丘', '驻马店', '太原', '大同', '忻州', '阳泉', '长治', '晋城', '朔州', '晋中', '运城', '临汾', '吕梁', '西安', '咸阳', '铜川', '延安', '宝鸡', '渭南', '汉中', '安康', '商洛', '榆林', '兰州', '天水', '平凉', '酒泉', '嘉峪关', '金昌', '白银', '武威', '张掖', '庆阳', '定西', '陇南', '西宁', '南昌', '九江', '赣州', '吉安', '鹰潭', '上饶', '萍乡', '景德镇', '新余', '宜春', '抚州','延边朝鲜族自治州', '恩施土家族苗族自治州', '湘西土家族苗族自治州', '临夏回族自治州', '甘南藏族自治州', '甘孜藏族自治州', '凉山彝族自治州', '阿坝藏族羌族自治州', '黔东南苗族侗族自治州', '黔南布依族苗族自治州', '黔西南布依族苗族自治州', '昌吉回族自治州', '伊犁哈萨克自治州', '博尔塔拉蒙古自治州', '巴音郭楞蒙古自治州', '黄南藏族自治州', '海北藏族自治州', '海南藏族自治州', '果洛藏族自治州', '玉树藏族自治州', '海西蒙古族藏族自治州', '迪庆藏族自治州', '楚雄彝族自治州', '大理白族自治州', '怒江傈僳族自治州', ' 西双版纳傣族自治州', '文山壮族苗族自治州', '德宏傣族景颇族自治州', '红河哈尼族彝族自治州', '克孜勒苏柯尔克孜自治州']
AREAS = ['东城区', '西城区', '朝阳区', '丰台区', '石景山区', '海淀区', '门头沟区', '房山区', '通州区', '顺义区', '昌平区', '大兴区', '怀柔区',
 '平谷区', '密云区', '延庆区', '和平区', '河东区', '河西区', '南开区', '河北区', '红桥区', '东丽区', '西青区',
 '津南区', '北辰区', '武清区', '宝坻区', '滨海新区', '宁河区', '静海区', '蓟州区', '长安区', '桥西区', '新华区',
 '井陉矿区', '裕华区', '藁城区', '鹿泉区', '栾城区', '井陉县', '正定县', '行唐县', '灵寿县', '高邑县', '深泽县', '赞皇县', '无极县', '平山县', '元氏县', '赵县', '石家庄高新技术产业开发区', '石家庄循环化工园区', '辛集市', '晋州市', '新乐市', '路南区', '路北区', '古冶区', '开平区', '丰南区', '丰润区', '曹妃甸区', '滦南县', '乐亭县', '迁西县', '玉田县', '唐山市芦台经济技术开发区', '唐山市汉沽管理区', '唐山高新技术产业开发区', '河北唐山海港经济开发区', '遵化市', '迁安市', '滦州市', '海港区', '山海关区', '北戴河区', '抚宁区', '青龙满族自治县', '昌黎县', '卢龙县', '秦皇岛市经济技术开发区', '北戴河新区', '邯山区', '丛台区', '复兴区', '峰峰矿区', '肥乡区', '永年区', '临漳县', '成安县', '大名县', '涉县', '磁县', '邱县', '鸡泽县', '广平县', '馆陶县', '魏县', '曲周县', '邯郸经济技术开发区', '邯郸冀南新区', '武安市', '桥东区', '桥西区', '邢台县', '临城县', '内丘县', '柏乡县', '隆尧县', '任县', '南和县', '宁晋县', '巨鹿县', '新河县', '广宗县', '平乡县', '威县', '清河县', '临西县', '河北邢台经济开发区', '南宫市', '沙河市', '竞秀区', '莲池区', '满城区', '清苑区', '徐水区', '涞水县', '阜平县', '定兴县', '唐县', '高阳县', '容城县', '涞源县', '望都县', '安新县', '易县', '曲阳县', '蠡县', '顺平县', '博野县', '雄县', '保定高新技术产业开发区', '保定白沟新城', '涿州市', '定州市', '安国市', '高碑店市', '桥东区', '桥西区', '宣化区', '下花园区', '万全区', '崇礼区', '张北县', '康保县', '沽源县', '尚义县', '蔚县', '阳原县', '怀安县', '怀来县', '涿鹿县', '赤城县', '张家口市高新技术产业开发区', '张家口市察北管理区', '张家口市塞北管理区', '双桥区', '双滦区', '鹰手营子矿区', '承德县', '兴隆县', '滦平县', '隆化县', '丰宁满族自治县', '宽城满族自治县', '围场满族蒙古族自治县', '承德高新技术产业开发区', '平泉市', '新华区', '运河区', '沧县', '青县', '东光县', '海兴县', '盐山县', '肃宁县', '南皮县', '吴桥县', '献县', '孟村回族自治县', '河北沧州经济开发区', '沧州高新技术产业开发区', '沧州渤海新区', '泊头市', '任丘市', '黄骅市', '河间市', '安次区', '广阳区', '固安县', '永清县', '香河县', '大城县', '文安县', '大厂回族自治县', '廊坊经济技术开发区', '霸州市', '三河市', '桃城区', '冀州区', '枣强县', '武邑县', '武强县', '饶阳县', '安平县', '故城县', '景县', '阜城县', '河北衡水高新技术产业开发区', '衡水滨湖新区', '深州市', '小店区', '迎泽区', '杏花岭区', '尖草坪区', '万柏林区', '晋源区', '清徐县', '阳曲县', '娄烦县', '山西转型综合改革示范区', '古交市', '新荣区', '平城区', '云冈区', '云州区', '阳高县', '天镇县', '广灵县', '灵丘县', '浑源县', '左云县', '山西大同经济开发区', '城区', '矿区', '郊区', '平定县', '盂县', '潞州区', '上党区', '屯留区', '潞城区', '襄垣县', '平顺县', '黎城县', '壶关县', '长子县', '武乡县', '沁县', '沁源县', '山西长治高新技术产业园区', '城区', '沁水县', '阳城县', '陵川县', '泽州县', '高平市', '朔城区', '平鲁区', '山阴县', '应县', '右玉县', '山西朔州经济开发区', '怀仁市', '榆次区', '榆社县', '左权县', '和顺县', '昔阳县', '寿阳县', '太谷县', '祁县', '平遥县', '灵石县', '介休市', '盐湖区', '临猗县', '万荣县', '闻喜县', '稷山县', '新绛县', '绛县', '垣曲县', '夏县', '平陆县', '芮城县', '永济市', '河津市', '忻府区', '定襄县', '五台县', '代县', '繁峙县', '宁武县', '静乐县', '神池县', '五寨县', '岢岚县', '河曲县', '保德县', '偏关县', '五台山风景名胜区', '原平市', '尧都区', '曲沃县', '翼城县', '襄汾县', '洪洞县', '古县', '安泽县', '浮山县', '吉县', '乡宁县', '大宁县', '隰县', '永和县', '蒲县', '汾西县', '侯马市', '霍州市', '离石区', '文水县', '交城县', '兴县', '临县', '柳林县', '石楼县', '岚县', '方山县', '中阳县', '交口县', '孝义市', '汾阳市', '新城区', '回民区', '玉泉区', '赛罕区', '土默特左旗', '托克托县', '和林格尔县', '清水河县', '武川县', '呼和浩特金海工业园区', '呼和浩特经济技术开发区', '东河区', '昆都仑区', '青山区', '石拐区', '白云鄂博矿区', '九原区', '土默特右旗', '固阳县', '达尔罕茂明安联合旗', '包头稀土高新技术产业开发区', '海勃湾区', '海南区', '乌达区', '红山区', '元宝山区', '松山区', '阿鲁科尔沁旗', '巴林左旗', '巴林右旗', '林西县', '克什克腾旗', '翁牛特旗', '喀喇沁旗', '宁城县', '敖汉旗', '科尔沁区', '科尔沁左翼中旗', '科尔沁左翼后旗', '开鲁县', '库伦旗', '奈曼旗', '扎鲁特旗', '通辽经济技术开发区', '霍林郭勒市', '东胜区', '康巴什区', '达拉特旗', '准格尔旗', '鄂托克前旗', '鄂托克旗', '杭锦旗', '乌审旗', '伊金霍洛旗', '海拉尔区', '扎赉诺尔区', '阿荣旗', '莫力达瓦达斡尔族自治旗', '鄂伦春自治旗', '鄂温克族自治旗', '陈巴尔虎旗', '新巴尔虎左旗', '新巴尔虎右旗', '满洲里市', '牙克石市', '扎兰屯市', '额尔古纳市', '根河市', '临河区', '五原县', '磴口县', '乌拉特前旗', '乌拉特中旗', '乌拉特后旗', '杭锦后旗', '集宁区', '卓资县', '化德县', '商都县', '兴和县', '凉城县', '察哈尔右翼前旗', '察哈尔右翼中旗', '察哈尔右翼后旗', '四子王旗', '丰镇市', '乌兰浩特市', '阿尔山市', '科尔沁右翼前旗', '科尔沁右翼中旗', '扎赉特旗', '突泉县', '二连浩特市', '锡林浩特市', '阿巴嘎旗', '苏尼特左旗', '苏尼特右旗', '东乌珠穆沁旗', '西乌珠穆沁旗', '太仆寺旗', '镶黄旗', '正镶白旗', '正蓝旗', '多伦县', '乌拉盖管委会', '阿拉善左旗', '阿拉善右旗', '额济纳旗', '内蒙古阿拉善经济开发区', '和平区', '沈河区', '大东区', '皇姑区', '铁西区', '苏家屯区', '浑南区', '沈北新区', '于洪区', '辽中区', '康平县', '法库县', '新民市', '中山区', '西岗区', '沙河口区', '甘井子区', '旅顺口区', '金州区', '普兰店区', '长海县', '瓦房店市', '庄河市', '铁东区', '铁西区', '立山区', '千山区', '台安县', '岫岩满族自治县', '海城市', '新抚区', '东洲区', '望花区', '顺城区', '抚顺县', '新宾满族自治县', '清原满族自治县', '平山区', '溪湖区', '明山区', '南芬区', '本溪满族自治县', '桓仁满族自治县', '元宝区', '振兴区', '振安区', '宽甸满族自治县', '东港市', '凤城市', '古塔区', '凌河区', '太和区', '黑山县', '义县', '凌海市', '北镇市', '站前区', '西市区', '鲅鱼圈区', '老边区', '盖州市', '大石桥市', '海州区', '新邱区', '太平区', '清河门区', '细河区', '阜新蒙古族自治县', '彰武县', '白塔区', '文圣区', '宏伟区', '弓长岭区', '太子河区', '辽阳县', '灯塔市', '双台子区', '兴隆台区', '大洼区', '盘山县', '银州区', '清河区', '铁岭县', '西丰县', '昌图县', '调兵山市', '开原市', '双塔区', '龙城区', '朝阳县', '建平县', '喀喇沁左翼蒙古族自治县', '北票市', '凌源市', '连山区', '龙港区', '南票区', '绥中县', '建昌县', '兴城市', '南关区', '宽城区', '朝阳区', '二道区', '绿园区', '双阳区', '九台区', '农安县', '长春经济技术开发区', '长春净月高新技术产业开发区', '长春高新技术产业开发区', '长春汽车经济技术开发区', '榆树市', '德惠市', '昌邑区', '龙潭区', '船营区', '丰满区', '永吉县', '吉林经济开发区', '吉林高新技术产业开发区', '吉林中国新加坡食品区', '蛟河市', '桦甸市', '舒兰市', '磐石市', '铁西区', '铁东区', '梨树县', '伊通满族自治县', '公主岭市', '双辽市', '龙山区', '西安区', '东丰县', '东辽县', '东昌区', '二道江区', '通化县', '辉南县', '柳河县', '梅河口市', '集安市', '浑江区', '江源区', '抚松县', '靖宇县', '长白朝鲜族自治县', '临江市', '宁江区', '前郭尔罗斯蒙古族自治县', '长岭县', '乾安县', '吉林松原经济开发区', '扶余市', '洮北区', '镇赉县', '通榆县', '吉林白城经济开发区', '洮南市', '大安市', '延吉市', '图们市', '敦化市', '珲春市', '龙井市', '和龙市', '汪清县', '安图县', '道里区', '南岗区', '道外区', '平房区', '松北区', '香坊区', '呼兰区', '阿城区', '双城区', '依兰县', '方正县', '宾县', '巴彦县', '木兰县', '通河县', '延寿县', '尚志市', '五常市', '龙沙区', '建华区', '铁锋区', '昂昂溪区', '富拉尔基区', '碾子山区', '梅里斯达斡尔族区', '龙江县', '依安县', '泰来县', '甘南县', '富裕县', '克山县', '克东县', '拜泉县', '讷河市', '鸡冠区', '恒山区', '滴道区', '梨树区', '城子河区', '麻山区', '鸡东县', '虎林市', '密山市', '向阳区', '工农区', '南山区', '兴安区', '东山区', '兴山区', '萝北县', '绥滨县', '尖山区', '岭东区', '四方台区', '宝山区', '集贤县', '友谊县', '宝清县', '饶河县', '萨尔图区', '龙凤区', '让胡路区', '红岗区', '大同区', '肇州县', '肇源县', '林甸县', '杜尔伯特蒙古族自治县', '大庆高新技术产业开发区', '伊春区', '南岔区', '友好区', '西林区', '翠峦区', '新青区', '美溪区', '金山屯区', '五营区', '乌马河区', '汤旺河区', '带岭区', '乌伊岭区', '红星区', '上甘岭区', '嘉荫县', '铁力市', '向阳区', '前进区', '东风区', '郊区', '桦南县', '桦川县', '汤原县', '同江市', '富锦市', '抚远市', '新兴区', '桃山区', '茄子河区', '勃利县', '东安区', '阳明区', '爱民区', '西安区', '林口县', '牡丹江经济技术开发区', '绥芬河市', '海林市', '宁安市', '穆棱市', '东宁市', '爱辉区', '嫩江县', '逊克县', '孙吴县', '北安市', '五大连池市', '北林区', '望奎县', '兰西县', '青冈县', '庆安县', '明水县', '绥棱县', '安达市', '肇东市', '海伦市', '漠河市', '呼玛县', '塔河县', '加格达奇区', '松岭区', '新林区', '呼中区', '黄浦区', '徐汇区', '长宁区', '静安区', '普陀区', '虹口区', '杨浦区', '闵行区', '宝山区', '嘉定区', '浦东新区', '金山区', '松江区', '青浦区', '奉贤区', '崇明区', '玄武区', '秦淮区', '建邺区', '鼓楼区', '浦口区', '栖霞区', '雨花台区', '江宁区', '六合区', '溧水区', '高淳区', '锡山区', '惠山区', '滨湖区', '梁溪区', '新吴区', '江阴市', '宜兴市', '鼓楼区', '云龙区', '贾汪区', '泉山区', '铜山区', '丰县', '沛县', '睢宁县', '徐州经济技术开发区', '新沂市', '邳州市', '天宁区', '钟楼区', '新北区', '武进区', '金坛区', '溧阳市', '虎丘区', '吴中区', '相城区', '姑苏区', '吴江区', '苏州工业园区', '常熟市', '张家港市', '昆山市', '太仓市', '崇川区', '港闸区', '通州区', '如东县', '南通经济技术开发区', '启东市', '如皋市', '海门市', '海安市', '连云区', '海州区', '赣榆区', '东海县', '灌云县', '灌南县', '连云港经济技术开发区', '连云港高新技术产业开发区', '淮安区', '淮阴区', '清江浦区', '洪泽区', '涟水县', '盱眙县', '金湖县', '淮安经济技术开发区', '亭湖区', '盐都区', '大丰区', '响水县', '滨海县', '阜宁县', '射阳县', '建湖县', '盐城经济技术开发区', '东台市', '广陵区', '邗江区', '江都区', '宝应县', '扬州经济技术开发区', '仪征市', '高邮市', '京口区', '润州区', '丹徒区', '镇江新区', '丹阳市', '扬中市', '句容市', '海陵区', '高港区', '姜堰区', '泰州医药高新技术产业开发区', '兴化市', '靖江市', '泰兴市', '宿城区', '宿豫区', '沭阳县', '泗阳县', '泗洪县', '宿迁经济技术开发区', '上城区', '下城区', '江干区', '拱墅区', '西湖区', '滨江区', '萧山区', '余杭区', '富阳区', '临安区', '桐庐县', '淳安县', '建德市', '海曙区', '江北区', '北仑区', '镇海区', '鄞州区', '奉化区', '象山县', '宁海县', '余姚市', '慈溪市', '鹿城区', '龙湾区', '瓯海区', '洞头区', '永嘉县', '平阳县', '苍南县', '文成县', '泰顺县', '温州经济技术开发区', '瑞安市', '乐清市', '南湖区', '秀洲区', '嘉善县', '海盐县', '海宁市', '平湖市', '桐乡市', '吴兴区', '南浔区', '德清县', '长兴县', '安吉县', '越城区', '柯桥区', '上虞区', '新昌县', '诸暨市', '嵊州市', '婺城区', '金东区', '武义县', '浦江县', '磐安县', '兰溪市', '义乌市', '东阳市', '永康市', '柯城区', '衢江区', '常山县', '开化县', '龙游县', '江山市', '定海区', '普陀区', '岱山县', '嵊泗县', '椒江区', '黄岩区', '路桥区', '三门县', '天台县', '仙居县', '温岭市', '临海市', '玉环市', '莲都区', '青田县', '缙云县', '遂昌县', '松阳县', '云和县', '庆元县', '景宁畲族自治县', '龙泉市', '瑶海区', '庐阳区', '蜀山区', '包河区', '长丰县', '肥东县', '肥西县', '庐江县', '合肥高新技术产业开发区', '合肥经济技术开发区', '合肥新站高新技术产业开发区', '巢湖市', '镜湖区', '弋江区', '鸠江区', '三山区', '芜湖县', '繁昌县', '南陵县', '无为县', '芜湖经济技术开发区', '安徽芜湖长江大桥经济开发区', '龙子湖区', '蚌山区', '禹会区', '淮上区', '怀远县', '五河县', '固镇县', '蚌埠市高新技术开发区', '蚌埠市经济开发区', '大通区', '田家庵区', '谢家集区', '八公山区', '潘集区', '凤台县', '寿县', '花山区', '雨山区', '博望区', '当涂县', '含山县', '和县', '杜集区', '相山区', '烈山区', '濉溪县', '铜官区', '义安区', '郊区', '枞阳县', '迎江区', '大观区', '宜秀区', '怀宁县', '太湖县', '宿松县', '望江县', '岳西县', '安徽安庆经济开发区', '桐城市', '潜山市', '屯溪区', '黄山区', '徽州区', '歙县', '休宁县', '黟县', '祁门县', '琅琊区', '南谯区', '来安县', '全椒县', '定远县', '凤阳县', '苏滁现代产业园', '滁州经济技术开发区', '天长市', '明光市', '颍州区', '颍东区', '颍泉区', '临泉县', '太和县', '阜南县', '颍上县', '阜阳合肥现代产业园区', '阜阳经济技术开发区', '界首市', '埇桥区', '砀山县', '萧县', '灵璧县', '泗县', '宿州马鞍山现代产业园区', '宿州经济技术开发区', '金安区', '裕安区', '叶集区', '霍邱县', '舒城县', '金寨县', '霍山县', '谯城区', '涡阳县', '蒙城县', '利辛县', '贵池区', '东至县', '石台县', '青阳县', '宣州区', '郎溪县', '广德县', '泾县', '绩溪县', '旌德县', '宣城市经济开发区', '宁国市', '鼓楼区', '台江区', '仓山区', '马尾区', '晋安区', '长乐区', '闽侯县', '连江县', '罗源县', '闽清县', '永泰县', '平潭县', '福清市', '思明区', '海沧区', '湖里区', '集美区', '同安区', '翔安区', '城厢区', '涵江区', '荔城区', '秀屿区', '仙游县', '梅列区', '三元区', '明溪县', '清流县', '宁化县', '大田县', '尤溪县', '沙县', '将乐县', '泰宁县', '建宁县', '永安市', '鲤城区', '丰泽区', '洛江区', '泉港区', '惠安县', '安溪县', '永春县', '德化县', '金门县', '石狮市', '晋江市', '南安市', '芗城区', '龙文区', '云霄县', '漳浦县', '诏安县', '长泰县', '东山县', '南靖县', '平和县', '华安县', '龙海市', '延平区', '建阳区', '顺昌县', '浦城县', '光泽县', '松溪县', '政和县', '邵武市', '武夷山市', '建瓯市', '新罗区', '永定区', '长汀县', '上杭县', '武平县', '连城县', '漳平市', '蕉城区', '霞浦县', '古田县', '屏南县', '寿宁县', '周宁县', '柘荣县', '福安市', '福鼎市', '东湖区', '西湖区', '青云谱区', '湾里区', '青山湖区', '新建区', '南昌县', '安义县', '进贤县', '昌江区', '珠山区', '浮梁县', '乐平市', '安源区', '湘东区', '莲花县', '上栗县', '芦溪县', '濂溪区', '浔阳区', '柴桑区', '武宁县', '修水县', '永修县', '德安县', '都昌县', '湖口县', '彭泽县', '瑞昌市', '共青城市', '庐山市', '渝水区', '分宜县', '月湖区', '余江区', '贵溪市', '章贡区', '南康区', '赣县区', '信丰县', '大余县', '上犹县', '崇义县', '安远县', '龙南县', '定南县', '全南县', '宁都县', '于都县', '兴国县', '会昌县', '寻乌县', '石城县', '瑞金市', '吉州区', '青原区', '吉安县', '吉水县', '峡江县', '新干县', '永丰县', '泰和县', '遂川县', '万安县', '安福县', '永新县', '井冈山市', '袁州区', '奉新县', '万载县', '上高县', '宜丰县', '靖安县', '铜鼓县', '丰城市', '樟树市', '高安市', '临川区', '东乡区', '南城县', '黎川县', '南丰县', '崇仁县', '乐安县', '宜黄县', '金溪县', '资溪县', '广昌县', '信州区', '广丰区', '上饶县', '玉山县', '铅山县', '横峰县', '弋阳县', '余干县', '鄱阳县','万年县', '婺源县', '德兴市', '历下区', '市中区', '槐荫区', '天桥区', '历城区', '长清区', '章丘区', '济阳区', '平阴县', '商河县', '济南高新技术产业开发区', '市南区', '市北区', '黄岛区', '崂山区', '李沧区', '城阳区', '即墨区', '青岛高新技术产业开发区', '胶州市', '平度市', '莱西市', '淄川区', '张店区', '博山区', '临淄区', '周村区', '桓台县', '高青县', '沂源县', '市中区', '薛城区', '峄城区', '台儿庄区', '山亭区', '滕州市', '东营区', '河口区', '垦利区', '利津县', '广饶县', '东营经济技术开发区', '东营港经济开发区', '芝罘区', '福山区', '牟平区', '莱山区', '长岛县', '烟台高新技术产业开发区', '烟台经济技术开发区', '龙口市', '莱阳市', '莱州市', '蓬莱市', '招远市', '栖霞市', '海阳市', '潍城区', '寒亭区', '坊子区', '奎文区', '临朐县', '昌乐县', '潍坊滨海经济技术开发区', '青州市', '诸城市', '寿光市', '安丘市', '高密市', '昌邑市', '任城区', '兖州区', '微山县', '鱼台县', '金乡县', '嘉祥县', '汶上县', '泗水县', '梁山县', '济宁高新技术产业开发区', '曲阜市', '邹城市', '泰山区', '岱岳区', '宁阳县', '东平县', '新泰市', '肥城市', '环翠区', '文登区', '威海火炬高技术产业开发区', '威海经济技术开发区', '威海临港经济技术开发区', '荣成市', '乳山市', '东港区', '岚山区', '五莲县', '莒县', '日照经济技术开发区', '莱城区', '钢城区', '兰山区', '罗庄区', '河东区', '沂南县', '郯城县', '沂水县', '兰陵县', '费县', '平邑县', '莒南县', '蒙阴县', '临沭县', '临沂高新技术产业开发区', '临沂经济技术开发区', '临沂临港经济开发区', '德城区', '陵城区', '宁津县', '庆云县', '临邑县', '齐河县', '平原县', '夏津县', '武城县', '德州经济技术开发区', '德州运河经济开发区', '乐陵市', '禹城市', '东昌府区', '阳谷县', '莘县', '茌平县', '东阿县', '冠县', '高唐县', '临清市', '滨城区', '沾化区', '惠民县', '阳信县', '无棣县', '博兴县', '邹平市', '牡丹区', '定陶区', '曹县', '单县', '成武县', '巨野县', '郓城县', '鄄城县', '东明县', '菏泽经济技术开发区', '菏泽高新技术开发区', '中原区', '二七区', '管城回族区', '金水区', '上街区', '惠济区', '中牟县', '郑州经济技术开发区', '郑州高新技术产业开发区', '郑州航空港经济综合实验区', '巩义市', '荥阳市', '新密市', '新郑市', '登封市', '龙亭区', '顺河回族区', '鼓楼区', '禹王台区', '祥符区', '杞县', '通许县', '尉氏县', '兰考县', '老城区', '西工区', '瀍河回族区', '涧西区', '吉利区', '洛龙区', '孟津县', '新安县', '栾川县', '嵩县', '汝阳县', '宜阳县', '洛宁县', '伊川县', '洛阳高新技术产业开发区', '偃师市', '新华区', '卫东区', '石龙区', '湛河区', '宝丰县', '叶县', '鲁山县', '郏县', '平顶山高新技术产业开发区', '平顶山市新城区', '舞钢市', '汝州市', '文峰区', '北关区', '殷都区', '龙安区', '安阳县', '汤阴县', '滑县', '内黄县', '安阳高新技术产业开发区', '林州市', '鹤山区', '山城区', '淇滨区', '浚县', '淇县', '鹤壁经济技术开发区', '红旗区', '卫滨区', '凤泉区', '牧野区', '新乡县', '获嘉县', '原阳县', '延津县', '封丘县', '长垣县', '新乡高新技术产业开发区', '新乡经济技术开发区', '新乡市平原城乡一体化示范区', '卫辉市', '辉县市', '解放区', '中站区', '马村区', '山阳区', '修武县', '博爱县', '武陟县', '温县', '焦作城乡一体化示范区', '沁阳市', '孟州市', '华龙区', '清丰县', '南乐县', '范县', '台前县', '濮阳县', '河南濮阳工业园区', '濮阳经济技术开发区', '魏都区', '建安区', '鄢陵县', '襄城县', '许昌经济技术开发区', '禹州市', '长葛市', '源汇区', '郾城区', '召陵区', '舞阳县', '临颍县', '漯河经济技术开发区', '湖滨区', '陕州区', '渑池县', '卢氏县', '河南三门峡经济开发区', '义马市', '灵宝市', '宛城区', '卧龙区', '南召县', '方城县', '西峡县', '镇平县', '内乡县', '淅川县', '社旗县', '唐河县', '新野县', '桐柏县', '南阳高新技术产业开发区', '南阳市城乡一体化示范区', '邓州市', '梁园区', '睢阳区', '民权县', '睢县', '宁陵县', '柘城县', '虞城县', '夏邑县', '豫东综合物流产业聚集区', '河南商丘经济开发区', '永城市', '浉河区', '平桥区', '罗山县', '光山县', '新县', '商城县', '固始县', '潢川县', '淮滨县', '息县', '信阳高新技术产业开发区', '川汇区', '扶沟县', '西华县', '商水县', '沈丘县', '郸城县', '淮阳县', '太康县', '鹿邑县', '河南周口经济开发区', '项城市', '驿城区', '西平县', '上蔡县', '平舆县', '正阳县', '确山县', '泌阳县', '汝南县', '遂平县', '新蔡县', '河南驻马店经济开发区', '济源市', '江岸区', '江汉区', '硚口区', '汉阳区', '武昌区', '青山区', '洪山区', '东西湖区', '汉南区', '蔡甸区', '江夏区', '黄陂区', '新洲区', '黄石港区', '西塞山区', '下陆区', '铁山区', '阳新县', '大冶市', '茅箭区', '张湾区', '郧阳区', '郧西县', '竹山县', '竹溪县', '房县', '丹江口市', '西陵区', '伍家岗区', '点军区', '猇亭区', '夷陵区', '远安县', '兴山县', '秭归县', '长阳土家族自治县', '五峰土家族自治县', '宜都市', '当阳市', '枝江市', '襄城区', '樊城区', '襄州区', '南漳县', '谷城县', '保康县', '老河口市', '枣阳市', '宜城市', '梁子湖区', '华容区', '鄂城区', '东宝区', '掇刀区', '沙洋县', '钟祥市', '京山市', '孝南区', '孝昌县', '大悟县', '云梦县', '应城市', '安陆市', '汉川市', '沙市区', '荆州区', '公安县', '监利县', '江陵县', '荆州经济技术开发区', '石首市', '洪湖市', '松滋市', '黄州区', '团风县', '红安县', '罗田县', '英山县', '浠水县', '蕲春县', '黄梅县', '龙感湖管理区', '麻城市', '武穴市', '咸安区', '嘉鱼县', '通城县', '崇阳县', '通山县', '赤壁市', '曾都区', '随县', '广水市', '恩施市', '利川市', '建始县', '巴东县', '宣恩县', '咸丰县', '来凤县', '鹤峰县', '仙桃市', '潜江市', '天门市', '神农架林区', '芙蓉区', '天心区', '岳麓区', '开福区', '雨花区', '望城区', '长沙县', '浏阳市', '宁乡市', '荷塘区', '芦淞区', '石峰区', '天元区', '渌口区', '攸县', '茶陵县', '炎陵县', '云龙示范区', '醴陵市', '雨湖区', '岳塘区', '湘潭县', '湖南湘潭高新技术产业园区', '湘潭昭山示范区', '湘潭九华示范区', '湘乡市', '韶山市', '珠晖区', '雁峰区', '石鼓区', '蒸湘区', '南岳区', '衡阳县', '衡南县', '衡山县', '衡东县', '祁东县', '衡阳综合保税区', '湖南衡阳高新技术产业园区', '湖南衡阳松木经济开发区', '耒阳市', '常宁市', '双清区', '大祥区', '北塔区', '邵东县', '新邵县', '邵阳县', '隆回县', '洞口县', '绥宁县', '新宁县', '城步苗族自治县', '武冈市', '岳阳楼区', '云溪区', '君山区', '岳阳县', '华容县', '湘阴县', '平江县', '岳阳市屈原管理区', '汨罗市', '临湘市', '武陵区', '鼎城区', '安乡县', '汉寿县', '澧县', '临澧县', '桃源县', '石门县', '常德市西洞庭管理区', '津市市', '永定区', '武陵源区', '慈利县', '桑植县', '资阳区', '赫山区', '南县', '桃江县', '安化县', '益阳市大通湖管理区', '湖南益阳高新技术产业园区', '沅江市', '北湖区', '苏仙区', '桂阳县', '宜章县', '永兴县', '嘉禾县', '临武县', '汝城县', '桂东县', '安仁县', '资兴市', '零陵区', '冷水滩区', '祁阳县', '东安县', '双牌县', '道县', '江永县', '宁远县', '蓝山县', '新田县', '江华瑶族自治县', '永州经济技术开发区', '永州市金洞管理区', '永州市回龙圩管理区', '鹤城区', '中方县', '沅陵县', '辰溪县', '溆浦县', '会同县']


def gettelnum(s):       #获得电话号码
    res = re.search(r'\d{11}', s)
    if res == None:
        return ""
    return res.group(0)

def getprovince(s):      ##获得省
    res = re.search(("(.*?省)|(.*?自治区)|上海市|北京市|天津市|重庆市"), s)
    if res != None:
        l = len(res.group(0))
    if res == None or l > 5:
        if s[0:3] == "黑龙江":
            return "黑龙江"
        if s[0:3] == "内蒙古":
            return "内蒙古"
        else:
            return s[0:2]
    return res.group(0)

def getcity(s):            #获得城镇
    res = re.search("(.*?自治州)|(.*?[市])", s)
    if res != None:
        l = len(res.group(0))
    if res == None or l > 7:
        for i in CITIES:
            if s[0:2] in i:
                return i
        return ""
    return res.group(0)

def getcounty(s):            #获得县
    #print(s)
    res = re.search("(.*?自治旗)|(.*?[县区市旗])", s)
    if res == None:
        #print("_____________________")
        for i in AREAS:
            if s[0:2] in i:
                return i
        return ""
    return res.group(0)

def gettown(s):         #获得城镇
    res = re.search("(.*?街道)|(.*?[镇乡])", s)
    if res == None:
        return ""
    return res.group(0)

def getroad(s): #获得路
    res = re.search("(.*?[路街巷道])", s)
    if res == None:
        return ""
    return res.group(0)

def getdoornum(s):                         #获得门牌号
    res = re.search("(.*?[号])", s)
    if res == None:
        return ""
    return res.group(0)

S = input()
A = S[0]
S = S[2:]
RESULT = S.split(",")
NAME = RESULT[0]
NOWS = RESULT[1]
TELNUM = gettelnum(NOWS)
NOWS = NOWS.replace(TELNUM, "", 1)
NOWS = NOWS.replace(".", "", 1)

PROVINCE = getprovince(NOWS)
if PROVINCE in ('北京', '上海', '天津', '重庆'):
    PROVINCE = PROVINCE
    NOWS = NOWS.replace(PROVINCE, PROVINCE + "市", 1)
elif PROVINCE in ('北京市', '上海市', '天津市', '重庆市'):
    PROVINCE = PROVINCE[0:2]
elif PROVINCE == "广西":
    NOWS = NOWS.replace(PROVINCE, "", 1)
    PROVINCE = PROVINCE + "壮族自治区"
elif PROVINCE == "新疆":
    NOWS = NOWS.replace(PROVINCE, "", 1)
    PROVINCE = PROVINCE + "维吾尔自治区"
elif PROVINCE == "宁夏":
    NOWS = NOWS.replace(PROVINCE, "", 1)
    PROVINCE = PROVINCE + "回族自治区"
elif PROVINCE == "内蒙古":
    NOWS = NOWS.replace(PROVINCE , "", 1)
    PROVINCE = PROVINCE + "自治区"
elif PROVINCE == "西藏":
    NOWS = NOWS.replace(PROVINCE, "", 1)
    PROVINCE = PROVINCE + "自治区"
elif PROVINCE[-1] != "省" and PROVINCE[-1] != "区":           #province = 黑龙江 福建
    NOWS = NOWS.replace(PROVINCE, "", 1)
    PROVINCE = PROVINCE + "省"
else:
    NOWS = NOWS.replace(PROVINCE, "", 1)

CITY = getcity(NOWS)

if CITY != "":
    NOWS = NOWS.replace(CITY, "", 1)
    if (CITY[-1] != "市") and (CITY[-3:-1] != "自治"):
        #print(city[-3:-1])
        CITY = CITY+"市"
        #print(CITY)


COUNTY = getcounty(NOWS)
if COUNTY != "":
    L = len(COUNTY)
    if COUNTY[-1] == NOWS[L-1]:
        NOWS = NOWS.replace(COUNTY, "", 1)
    else:
        NOWS = NOWS.replace(COUNTY[:-1], "", 1)
        #print(county[:-1])
TOWN = gettown(NOWS)
NOWS = NOWS.replace(TOWN, "", 1)
DETAIADDR = NOWS

ROAD = getroad(NOWS)
NOWS = NOWS.replace(ROAD, "", 1)

DOORNUM = getdoornum(NOWS)
NOWS = NOWS.replace(DOORNUM, "", 1)

DICT = {}
DICT["姓名"] = NAME
DICT["手机"] = TELNUM
ADDRLIST = []
if A == '1':
    ADDRLIST.append(PROVINCE)
    ADDRLIST.append(CITY)
    ADDRLIST.append(COUNTY)
    ADDRLIST.append(TOWN)
    ADDRLIST.append(DETAIADDR)
else:
    ADDRLIST.append(PROVINCE)
    ADDRLIST.append(CITY)
    ADDRLIST.append(COUNTY)
    ADDRLIST.append(TOWN)
    ADDRLIST.append(ROAD)
    ADDRLIST.append(DOORNUM)
    ADDRLIST.append(NOWS)
DICT["地址"] = ADDRLIST

#print(DICT)
print(json.dumps(DICT))